In [14]:
import pandas as pd

data = {
    "name": ["Alice", "Bob", "Charlie"],
    "Age": [25, 30, 35],
}

df = pd.DataFrame(data)
df

      name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [15]:
df["City"] = ["new york", "los angeles", "Chicago"]
df

      name  Age         City
0    Alice   25     new york
1      Bob   30  los angeles
2  Charlie   35      Chicago

In [16]:
df["Age Group"] = ["Young" if age < 30 else "Mature" for age in df["Age"]]
df

      name  Age         City Age Group
0    Alice   25     new york     Young
1      Bob   30  los angeles    Mature
2  Charlie   35      Chicago    Mature

In [17]:
df = df.drop("Age Group", axis=1)
df

      name  Age         City
0    Alice   25     new york
1      Bob   30  los angeles
2  Charlie   35      Chicago

In [18]:
df = df.drop(1)
df

      name  Age      City
0    Alice   25  new york
2  Charlie   35   Chicago